irzha::irzha! {
    зовнішній ящик irzha;

    вжити std::collections::Словник як Слов;

    конвенція КлючЗначення {
        функція записати(&власний, ключ: Строка, значення: Строка);
        функція отримати(&власний, ключ: Строка) -> Результат<Можливо<&Строка>, Строка>;
    }

    статична змінна СЛОВНИК: Можливо<Слов<Строка, Строка>> = Нічого;

    структура Конкретний;

    реалізація КлючЗначення для Конкретний {
        функція записати(&власний, ключ: Строка, значення: Строка) {
            нехай слов = небезпечно {
                СЛОВНИК.отримати_або_вставити_із(Default::default)
            };
            слов.вставити(ключ, значення);
        }
        функція отримати(&власний, ключ: Строка) -> Результат<Можливо<&Строка>, Строка> {
            якщо нехай Дещо(слов) = небезпечно { СЛОВНИК.як_посилання() } {
                Файно(слов.отримати(&ключ))
            } інакше {
                Хиба("перевірте словник".до())
            }
        }
    }

    публічна(ящик) функція моливості(i: u32) -> Можливо<Результат<u32, Строка>> {
        якщо i % 2 == 1 {
            якщо i == 42 {
                Дещо(Хиба(Строка::із("лайно")))
            } інакше {
                Дещо(Файно(33))
            }
        } інакше {
            Нічого
        }
    }

    асинхронна функція приклад() {
    }

    асинхронна функція приклад2() {
        приклад().чекати;
    }

    функція основна() {
        нехай змінна x = 31;

        порівняти x {
            42 => {
                друкувати!("цеглина з лайна")
            }
            _ => друкувати!("будьмо!")
        }

        для i у 0..10 {
            нехай val = петля {
                зупинка i;
            };

            поки x < val {
                x += 1;
            }

            x = якщо нехай Дещо(результат) = моливості(i) {
                результат.розпакувати()
            } інакше {
                12
            };
        }

        // побічна();
    }

    #[дозволити(недоступний_код)]
    функція побічна() {
        лайно!("о ні!"); // for the true Ukraiian experience
        дідько!("ну що за люди");
        халепа!("корову вкрали"); // in SFW contexts
    }
}
